from flask import Flask, render_template, json
import pandas as pd
from pandas import DataFrame

app = Flask(__name__)

@app.route('/')
def index():
    df = pd.read_csv("station.csv")
    a = df.values.tolist()
    a = [[13.736717,100.523186,29],
         [15.5337283,101.0490618,28],
         [14.4344572,101.3382849,30],
         [14.1786371,101.6463547,28],
         [14.3223389,101.3168609,29],
         [11.7112437,99.5839528,27],
         [14.3118684,99.0696813,27],
         [14.2086742,98.7248681,29],
         [16.9228372,101.4344774,27],
         [15.8889687,104.7762545,30]]
    b = json.dumps([["กรุงเทพมหานคร","rainy"],
                    ["วนอุทยานแห่งชาติพุม่วง","suny"],
                    ["อุทยานแห่งชาติเขาใหญ่","hazy"],
                    ["อุทยานแห่งชาติทับลาน","rainy"],
                    ["อุทยานแห่งชาตินางรอง","suny"],
                    ["อุทยานแห่งชาติน้ำตกห้วยยาง","suny"],
                    ["อุทยานแห่งชาติเอราวัณ","hazy"],
                    ["อุทยานแห่งชาติทองผาภูมิ","rainy"],
                    ["อุทยานแห่งชาติภูกระดึง","suny"],
                    ["วนอุทยานภูสิงห์-ภูผาผึ้ง","suny"]])


    return render_template('index.html', station = a,ads=b)

if __name__ == '__main__':
    app.run(debug=True, host='0.0.0.0')
